{
  "posts": [
    {
      "id": 1,
      "title": "title-1"
    },
    {
      "id": 2,
      "title": "title-2"
    },
    {
      "id": 3,
      "title": "title-3"
    },
    {
      "id": 4,
      "title": "title-4"
    },
    {
      "id": 5,
      "title": "title-5"
    }
  ],
  "profile": {
    "name": "typicode"
  },
  "composers": [
    {
      "nombre": "Ludwig van Beethoven",
      "resumen": "Ludwig van Beethoven​ fue un compositor, director de orquesta y pianista alemán. Su legado musical abarca, cronológicamente, desde el Clasicismo hasta los inicios del Romanticismo.",
      "bio": "<p>Ludwig van Beethoven (Bonn, Arzobispado de Colonia, 16 de diciembre de 17702​-Viena, 26 de marzo de 1827) fue un compositor, director de orquesta y pianista alemán. Su legado musical abarca, cronológicamente, desde el Clasicismo hasta los inicios del Romanticismo.</p><p>Es considerado uno de los compositores más importantes de la historia de la música y su legado ha influido de forma decisiva en la evolución posterior de este arte. Siendo el último gran representante del clasicismo vienés (después de Christoph Willibald Gluck, Joseph Haydn y Wolfgang Amadeus Mozart), Beethoven consiguió hacer trascender la música del Romanticismo, influyendo en diversidad de obras musicales del siglo XIX. Su arte se expresó en numerosos géneros y aunque las sinfonías fueron la fuente principal de su popularidad internacional, su impacto resultó ser principalmente significativo en sus obras para piano y música de cámara.</p><p>Su producción incluye los géneros pianístico (treinta y dos sonatas para piano), de cámara (incluyendo numerosas obras para conjuntos instrumentales de entre ocho y dos miembros), concertante (conciertos para piano, para violín y triple), sacra (dos misas, un oratorio), lieder, música incidental (la ópera Fidelio, un ballet, músicas para obras teatrales), y orquestal, en la que ocupan lugar preponderante Nueve sinfonías.</p>",
      "nacimiento": "diciembre de 1770, Bonn, Alemania",
      "fallecimiento": "26 de marzo de 1827, Viena, Austria",
      "img": "https://images.fineartamerica.com/images/artworkimages/mediumlarge/1/ludwig-van-beethoven-composing-his-missa-solemnis-joseph-carl-stieler.jpg"
    },
    {
      "nombre": "Wolfgang Amadeus Mozart",
      "resumen": "Johannes Chrysostomus Wolfgangus Theophilus Mozart​, más conocido como Wolfgang Amadeus Mozart o simplemente Mozart, fue un compositor y pianista del antiguo Arzobispado de Salzburgo, maestro del Clasicismo, considerado como uno de los músicos más influyentes y destacados de la historia.",
      "bio": "<p>Johannes Chrysostomus Wolfgangus Theophilus Mozarta​ (Salzburgo, 27 de enero de 1756-Viena, 5 de diciembre de 1791), más conocido como Wolfgang Amadeus Mozart o simplemente Mozart, fue un compositor y pianista del antiguo Arzobispado de Salzburgo (anteriormente parte del Sacro Imperio Romano Germánico, actualmente parte de Austria), maestro del Clasicismo, considerado como uno de los músicos más influyentes y destacados de la historia.</p><p>La obra mozartiana abarca todos los géneros musicales de su época e incluye más de seiscientas creaciones, en su mayoría reconocidas como obras maestras de la música sinfónica, concertante, de cámara, para fortepiano, operística y coral, logrando una popularidad y difusión internacional.</p><p> En su niñez más temprana en Salzburgo, Mozart mostró una capacidad prodigiosa en el dominio de instrumentos de teclado y del violín. Con tan solo cinco años ya componía obras musicales y sus interpretaciones eran del aprecio de la aristocracia y realeza europea.</p><p> A los diecisiete años fue contratado como músico en la corte de Salzburgo, pero su inquietud le llevó a viajar en busca de una mejor posición, siempre componiendo de forma prolífica.</p><p> Durante su visita a Viena en 1781, tras ser despedido de su puesto en la corte, decidió instalarse en esta ciudad donde alcanzó la fama que mantuvo el resto de su vida, a pesar de pasar por situaciones financieras difíciles.</p><p> En sus años finales, compuso muchas de sus sinfonías, conciertos y óperas más conocidas, así como su Réquiem.</p><p> Las circunstancias de su temprana muerte han sido objeto de numerosas especulaciones y elevadas a la categoría de mito. Según críticos de música como Nicholas Till, Mozart siempre aprendía vorazmente de otros músicos y desarrolló un esplendor y una madurez de estilo que abarcó desde la luz y la elegancia, a la oscuridad y la pasión —todo bien fundado por una visión de la humanidad «redimida por el arte, perdonada y reconciliada con la naturaleza y lo absoluto»—.1​ Su influencia en toda la música occidental posterior es profunda; Ludwig van Beethoven escribió sus primeras composiciones a la sombra de Mozart, de quien Joseph Haydn escribió que «la posteridad no verá tal talento otra vez en cien años»</p>",
      "nacimiento": "27 de enero de 1756, Estado de Salzburgo, Austria",
      "fallecimiento": "5 de diciembre de 1791, Viena, Austria",
      "img": "https://e00-elmundo.uecdn.es/elmundosalud/imagenes/2008/08/18/1219072715_0.jpg"
    },
    {
      "nombre": "Johann Sebastian Bach",
      "resumen": "Johann Sebastian Bach fue un compositor, organista, clavecinista, violinista, violista, maestro de capilla y cantor alemán del periodo barroco. Fue el miembro más importante de una de las familias de músicos más destacadas de la historia, con más de 35 compositores famosos.",
      "bio": "<p>Johann Sebastian Bach (Eisenach, en la actual Turingia, Sacro Imperio Romano Germánico, 21 de marzojul./ 31 de marzo de 1685greg.-Leipzig, en la actual Sajonia, Sacro Imperio Romano Germánico, 17 de juliojul./ 28 de julio de 1750greg.) fue un compositor, organista, clavecinista, violinista, violista, maestro de capilla y cantor alemán del periodo barroco.</p><p>Fue el miembro más importante de una de las familias de músicos más destacadas de la historia, con más de 35 compositores famosos. Tuvo una gran fama como organista y clavecinista en toda Europa por su gran técnica y capacidad de improvisar música al teclado. Además del órgano y del clavecín, tocaba el violín y la viola da gamba.</p><p>Su fecunda obra es considerada la cumbre de la música barroca; destaca en ella su profundidad intelectual, su perfección técnica y su belleza artística, además de la síntesis de los diversos estilos nacionales de su época y del pasado. Bach es considerado el último gran maestro del arte del contrapunto,1​ y fuente de inspiración e influencia para posteriores compositores y músicos, desde Wolfgang Amadeus Mozart pasando por Ludwig van Beethoven, Félix Mendelssohn, Robert Schumann, Franz Liszt, Johannes Brahms, Richard Wagner, Richard Strauss y Gustav Mahler hasta músicos más recientes como Arnold Schönberg, Anton Webern, Paul Hindemith, Ígor Stravinski, Heitor Villa-Lobos o Astor Piazzolla, entre muchos otros.</p><p>Entre sus obras más conocidas se encuentran los Conciertos de Brandeburgo, El clave bien temperado, la Misa en si menor, la Pasión según San Mateo, El arte de la fuga, Ofrenda musical, las Variaciones Goldberg, la Tocata y fuga en re menor, varios ciclos de cantatas (entre ellas las célebres BWV 140 y BWV 147), el Concierto italiano, la Obertura francesa, las Suites para violonchelo solo, las Sonatas y partitas para violín solo, los Conciertos para teclado y las Suites para orquesta.</p>",
      "nacimiento": "31 de marzo de 1685, Eisenach, Alemania",
      "fallecimiento": "28 de julio de 1750, Leipzig, Alemania",
      "img": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Johann_Sebastian_Bach.jpg"
    },
    {
      "nombre": "Frédéric Chopin",
      "resumen": "Fryderyk Franciszek Chopin ​ fue un compositor y virtuoso pianista polaco​​​​, considerado uno de los más importantes de la historia y uno de los mayores representantes del Romanticismo musical.",
      "bio": "<p>Frédéric Chopin nació en la aldea de Żelazowa Wola, en el voivodato de Mazovia, a 60 kilómetros de Varsovia en el centro de Polonia, en una pequeña finca propiedad del conde Skarbek, que formaba parte del Gran Ducado de Varsovia. Recibió el nombre de Fryderyk Franciszek Chopin. La fecha de su nacimiento es incierta: el propio compositor (y su familia) declaraba haber venido al mundo el 1 de marzo de 1810 y siempre celebró su cumpleaños en aquella fecha. Pero en su partida bautismal figura como nacido el 22 de febrero. Lo más probable es que esto último fuese un error del sacerdote (fue bautizado el 23 de abril en la iglesia parroquial de Brochow, cerca de Sochaczew, casi ocho semanas después del nacimiento). Esta discordancia se discute hasta el día de hoy.</p><p>Su padre, Mikołaj Chopin (Marainville, Lorena, 1771-1844), era un emigrado francés con lejanos ancestros polacos, que se había trasladado a Polonia en 1787, animado por la defensa de la causa polaca, y era profesor de francés y literatura francesa; también era preceptor de la familia del conde Skarbek. Su madre, Tekla Justyna Krzyżanowska (Dlugie, Kujawy, 1782-1868), pertenecía a una familia de la nobleza polaca venida a menos y era gobernanta de la finca. Sin embargo, la familia se trasladó a Varsovia en octubre del mismo año, pues su padre había obtenido el puesto de profesor de francés en el Liceo de Varsovia. Ambos tuvieron tres hijas más: Ludwika (también conocida como Ludvika, 1807-1855), Izabella (1811-1881) y Emilia (1813-1827). Frédéric era el segundo hijo y único varón.</p><p>Frédéric Chopin y sus hermanas crecieron en un entorno en el que el gusto por la cultura en general y, la música en particular, era considerable. Su primera maestra de piano fue su hermana Ludwika, con quien luego tocaba duetos para piano a cuatro manos. Al destacar pronto sus excepcionales cualidades, a los seis años sus padres lo pusieron en manos del maestro Wojciech Żywny, violinista, amante de la música de Johann Sebastian Bach (hecho entonces poco común) y de Wolfgang Amadeus Mozart, y que basaba sus enseñanzas principalmente en dichos compositores.</p><p>Un año más tarde, cuando tenía siete años de edad, compuso su primera obra. Como no sabía escribir muy bien, la pieza fue anotada por su padre. Se trataba de la Polonesa en sol menor para piano, publicada en noviembre de 1817 en el taller de grabado del padre J. J. Cybulski, director de la Escuela de Organistas y uno de los pocos editores de música polacos de su tiempo. Ese mismo año compuso otra Polonesa en si bemol mayor. A estas siguieron otras polonesas, además de marchas y variaciones. Algunas de estas composiciones se han perdido.</p><p>A los ocho años tocaba el piano con maestría, improvisaba y componía con soltura: dio su primer concierto público el 24 de febrero de 1818 en el palacio de la familia Radziwill de Varsovia, donde tocó el Concierto en mi menor de Vojtech Jirovec. Pronto se hizo conocido en el ambiente local de la ciudad, considerado por todos como un niño prodigio y llamado el «pequeño Chopin». Comenzó a dar recitales en las recepciones de los salones aristocráticos de la ciudad, para las familias Czartoryski, Grabowski, Sapieha, Mokronowski, Czerwertynski, Zamoyski, Radziwill, Lubecki, Zajaczek, Skarbek y Tenczynski, tal como hiciese Mozart a la misma edad. Así se ganó un número creciente de admiradores.</p><p>También desde su niñez se manifestó ya un hecho que marcó poderosamente su vida: su quebradiza salud. Desde niño había sufrido inflamaciones de los ganglios del cuello y había tenido que soportar frecuentes sangrías.</p>",
      "nacimiento": "1 de marzo de 1810, Żelazowa Wola, Polonia",
      "fallecimiento": "17 de octubre de 1849, París, Francia",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Frederic_Chopin_photo.jpeg/220px-Frederic_Chopin_photo.jpeg"
    },
    {
      "nombre": "Pyotr Ilyich Tchaikovsky",
      "resumen": "Pyotr Ilyich Tchaikovsky ​fue un compositor ruso del período del Romanticismo. Es autor de algunas de las obras de música clásica más famosas del repertorio actual, como los ballets El lago de los Cisnes...",
      "bio": "<p>Pyotr Ilyich Tchaikovsky fue un compositor ruso del período del Romanticismo. Es autor de algunas de las obras de música clásica más famosas del repertorio actual, como los ballets El lago de los cisnes, La bella durmiente y El cascanueces, la Obertura 1812, la obertura-fantasía Romeo y Julieta, el Primer concierto para piano, el Concierto para violín, sus sinfonías Cuarta, Quinta y Sexta y la ópera Eugenio Oneguin.</p><p>Nacido en una familia de clase media, la educación que recibió Chaikovski estaba dirigida a prepararle como funcionario, a pesar del interés musical que mostró. En contra de los deseos de su familia, decidió seguir una carrera musical y en 1862 accedió al Conservatorio de San Petersburgo, graduándose en 1865. La formación que recibió, formal y orientada al estilo musical occidental, lo apartó del movimiento contemporáneo nacionalista conocido como el «Grupo de los Cinco» conformado por un grupo de jóvenes compositores rusos, con los cuales Chaikovski mantuvo una relación profesional y de amistad a lo largo de su carrera.</p><p>Mientras desarrollaba su estilo, Chaikovski escribió música en varios géneros y formas, incluyendo la sinfonía, ópera, ballet, música instrumental, de cámara y la canción. A pesar de contar con varios éxitos, nunca tuvo mucha confianza o seguridad en sí mismo y su vida estuvo salpicada por crisis personales y periodos de depresión. Como factores que quizá contribuyeron a esto, pueden mencionarse su homosexualidad reprimida y el miedo a que se revelara su condición, su desastroso matrimonio y el repentino colapso de la única relación duradera que mantuvo en su vida adulta: su asociación de 13 años con la rica viuda Nadezhda von Meck. En medio de esta agitada vida personal, la reputación de Chaikovski aumentó; recibió honores por parte del zar, obtuvo una pensión vitalicia y fue alabado en las salas de conciertos de todo el mundo. Su repentina muerte a los 53 años suele atribuirse generalmente al cólera, pero algunos lo atribuyen a un suicidio.</p><p>A pesar de ser popular en todo el mundo, Chaikovski recibió a veces duras críticas por parte de críticos y compositores. Sin embargo, su reputación como compositor es hoy en día segura,2​ y ha desaparecido por completo el desdén con el que los críticos occidentales a principios y mediados del siglo XX catalogaban su música como vulgar y falta de pensamiento.</p><p>De hecho, Chaikovski está considerado actualmente como el más destacado músico de Rusia y una de las figuras más importantes de la cultura de ese país a lo largo de su historia.</p>​",
      "nacimiento": "7 de mayo de 1840, Vótkinsk, Rusia",
      "fallecimiento": "6 de noviembre de 1893, San Petersburgo, Rusia",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Portr%C3%A4t_des_Komponisten_Pjotr_I._Tschaikowski_%281840-1893%29_cropped.jpg/220px-Portr%C3%A4t_des_Komponisten_Pjotr_I._Tschaikowski_%281840-1893%29_cropped.jpg"
    }
  ]
}